
#ifndef GLOBALS_H
#define GLOBALS_H

#include "MMemory.h"
#include <d3dx9.h>
#include <vector>
#include <map>
#include <mutex>

#include <iostream>

extern "C" {
# include "lua.h"
# include "lauxlib.h"
# include "lualib.h"
}

#include <LuaBridge/LuaBridge.h>

//////


//////


static class LuaKeeper {
public:
	static std::vector<lua_State*> lua_list;
	static std::mutex mtx;           // mutex for critical section
};





#define XOR_KEY 0x342626A
//(unsigned int)(Management::LolClient.dwBase + 0x327626A)



class CObject;

static class Settings {
public:
	static bool drawings_enabled;
	static bool hero_line_draw;

};


static class Management {
public:
	static Memory Manager;
	static Module LolClient;
	static std::vector<CObject> Player_List;
	static std::map<int, int> Priority_List;
	static float percent_health;
	static CObject current_target;
	static CObject local_player;
	static CObject under_mouse_object;
	static bool wait_for_usage;
};



 template<typename T, typename U> constexpr size_t offsetOf(U T::*member)
{
	return (char*)&((T*)nullptr->*member) - (char*)nullptr;
}

static class offsets {
public:
	 static DWORD m_LocalPlayer; // 3A1AFA4 0x2F709C0 A1 ? ? ? ? 85 C0 0F 84 ? ? ? ? 56 8B B0

	 static DWORD m_UnderMouseObj; // C7 05 ? ? ? ? ? ? ? ? E8 ? ? ? ? 83 C4 04 FF B4

	 static DWORD m_ObjectList; // B9 ? ? ? ? E8 ? ? ? ? 8B C8 8B 10 8B 82

	 static DWORD m_RendererClass; // 8B 15 ? ? ? ? 83 EC 08 F3

	 static DWORD m_PingContainer; // 8B 0D ? ? ? ? 85 C9 74 06 5E || A1 ? ? ? ? 57 8B B0 

	 static DWORD m_AttackDelayOff; // B9 ? ? ? ? E8 ? ? ? ? B9 ? ? ? ? F3
};










#define MAKE_PAD(size) char pad##size##[size];


enum DmgTypes {
	Physical = 0,
	Magical,
	True
};

enum VisibleEnum
{
	Visible = 257,
	nonVisible = 256
};


enum EntityTypes {
	Hero = 5121,
	Mobs = 3073,
	Structure = 131077
};


enum Team {
	FirstTeam = 100,
	SeconTeam = 200,
	Jungle = 300
};

enum LifeState
{
	Living = 642,
	Dead = 658
};

template <typename obfuscation>
__forceinline obfuscation deobfuscate(int obj, uintptr_t offset)
{
	uintptr_t tmp1 = obj + offset;
	BYTE temp[100];
	ReadProcessMemory(Management::Manager._process, (LPCVOID)(obj + offset), temp, 100, 0);

	uint8_t tmp2 = temp[0x1];
	uintptr_t tmp3 = temp[0x10];

	uintptr_t tmp_xor = *(uintptr_t*)&temp[0x4 * tmp2 + 0x4];

	tmp_xor ^= ~(tmp3 ^ XOR_KEY);

	return *(obfuscation*)(&tmp_xor);
}

enum SpellSlots {
	Spell_Q = 0,
	Spell_W,
	Spell_E,
	Spell_R,
	Spell_D,
	Spell_F,
	Spell_1,
	Spell_2,
	Spell_3,
	Spell_4,
	Spell_5,
	Spell_6,
	Spell_7
};


class CRenderer
{
public:
	MAKE_PAD(0x18);
	int ScreenResolutionX; //0x18
	int ScreenResolutionY; //0x1C
	MAKE_PAD(0x48);
	D3DXMATRIX ViewMatrix; //0x8C
	D3DXMATRIX ProjectionMatrix; //0xCC
};


class CSpellInfo {
public:
	MAKE_PAD(0x1C);
	int level; // 0x1C
	MAKE_PAD(0x4);
	float time; // 0x24
	MAKE_PAD(0x58);
	float vayneQDamage;
};

class Smth1 {
public:
	MAKE_PAD(0x1EC);
	float unknownFloat;
};

class Smth2 {
public:
	MAKE_PAD(0x1C);
	Smth1 unknownSmth1;
};

bool isHeroSupporter(int hero, int a2);


//bool isHeroSupporter(int hero, int a2)
//{
//	unsigned __int8 _this[0x100];
//	ReadProcessMemory(Manager._process, (LPBYTE)hero + 72, _this, 0x100, NULL);
//	int v2; // eax
//	unsigned int v4; // ecx
//	unsigned int v5; // edi
//	int *v6; // edx
//	int v7; // eax
//	BYTE v8; // al
//	unsigned int i; // eax
//	int v11; // [esp+8h] [ebp-4h]
//
//	v2 = _this[1];
//	v4 = 0;
//	v5 = _this[20];
//
//	std::cout << "v5: " << v5 << std::endl;
//
//	std::cout << "v11 equaling" << std::endl;
//	v11 = *(int*)&_this[4 * v2 + 4];
//	if (v5)
//	{
//		v6 = (int *)(_this + 16);
//		do
//		{
//			std::cout << "v4: " <<v4 << std::endl;
//
//
//			try {
//				v7 = *v6;
//				++v6;
//				*(&v11 + v4) ^= ~(v7 ^ XOR_KEY);
//				++v4;
//			}
//			catch (...) {
//				break;
//			}
//		} while (v4 < v5);
//	}
//	v8 = _this[21];
//	if (v8)
//	{
//		for (i = 4 - v8; i < 4; ++i)
//		{
//			std::cout << "i: " << i << std::endl;
//
//			*((BYTE *)&v11 + i) ^= *(BYTE *)(_this + i + 16) ^ 0xA5;
//		}
//	}
//
//
//	return (v11 & a2) != 0;
//
//}

float AttackCastDelay(int a1, int a2); // sub_11140C0
float AttackDelay(DWORD a1, float a2); // sub_11141C0




inline int GetPing()
{
	return Management::Manager.Read<int>(Management::Manager.Read<int>(Management::Manager.Read<int>(Management::LolClient.dwBase + offsets::m_PingContainer) + 0x68) + 0x18);
}

enum class BuffType {
	Internal = 0,
	Aura = 1,
	CombatEnchancer = 2,
	CombatDehancer = 3,
	SpellShield = 4,
	Stun = 5,
	Invisibility = 6,
	Silence = 7,
	Taunt = 8,
	Polymorph = 9,
	Slow = 10,
	Snare = 11,
	Damage = 12,
	Heal = 13,
	Haste = 14,
	SpellImmunity = 15,
	PhysicalImmunity = 16,
	Invulnerability = 17,
	Sleep = 18,
	NearSight = 19,
	Frenzy = 20,
	Fear = 21,
	Charm = 22,
	Poison = 23,
	Suppression = 24,
	Blind = 25,
	Counter = 26,
	Shred = 27,
	Flee = 28,
	Knockup = 29,
	Knockback = 30,
	Disarm = 31
};


typedef struct Node{
public:
	int abc;
};

void teasdasd()
{
	Node test;

}

class CObject {
public:
	int vtable;
	char pad_0x0000[0x40]; //0x0000
	__int32 team; //0x0044 
	char pad_0x0048[0x18]; //0x0048
	char name[0x78]; //0x60
	D3DXVECTOR3 bounding_box_first_point; //0x60
	D3DXVECTOR3 bounding_box_second_point; //0x60
	char pad_f0[0x20]; //0xF0
	int network_id; //0x0110 
	char pad_0x0114[0x88]; //0x0114
	D3DXVECTOR3 position; // 0x019C

	//float positionx; //0x019C 
	//float positiony; //0x019C 
	//float positionz; //0x019C 
	char pad_0x01A8[0xA4]; //0x01A8
	__int16 source_index; //0x024C 
	char pad_0x0250[0x16]; //0x0250
	D3DXVECTOR3 skill_start_pos;
	D3DXVECTOR3 skill_end_pos;
	char pad_0x027C[0x1C]; //0x027C
	__int16 target_id; //0x0298 
	char pad_0x029C[0x136]; //0x029C
	__int32 visible;//0x3D0
	char pad_0x03D4[0x24]; //0x03D4
	float mana; //0x03F8 
	char pad_0x03FC[0xC]; //0x03FC
	float max_mana; //0x0408 
	char pad_0x040C[0x68]; //0x040C
	char pad_sd[0x2A4]; // 0x474
	float missileLineWidth; // 0x718
	char pad_0x071C[0x6A8]; //pad_0x071C
	float health; //0xDC4 
	char pad_0x0DEC[0xC]; //0x0DEC
	float max_health; //0x0DF8 
	char pad_0x0DFC[0x3E8]; //0x0DFC
	float bonus_attack; //0x11E0 
	char pad_0x11E4[0xC]; //0x11E4
	float bonus_ability_attack; //0x11F0 
	char pad_0x11F4[0x68]; //0x11F4
	float attack_speed_mod; // 0x125C
	float base_attack; //0x1260 
	char pad_0x1264[0x20]; //0x1264
	float crit_mod; //0x1284 
	float armor; //0x1288 
	char pad_0x128C[0x4]; //0x128C
	float magic_resist; //0x1290 
	float bonus_magic_resist; //0x1294 
	char pad_0x1298[0x8]; //0x1298
	float move_speed; //0x12A0 
	char pad_0x12A4[0x4]; //0x12A4
	float attack_range; //0x12A8 
	char pad_0x12AC[0xE44]; //0x12AC
	DWORD buff_manager; //0x20F0 
	char pad_0x20F4[0x7B4]; //0x20F4
	DWORD spell_book; //0x28A8 
	char pad_0x28AC[0x3C]; //0x28AC
	int current_attack; // 0x28C8
	char pad_0x28CC[0x88C]; //0x28CC
	char hero_name[60]; // 0x3158
	//__int32 level; //0x4964 
	// 0x28C8 is attacking
	int basePosition;
	float predicted_health;
	int predicted_after_time;
	int focus_count;


	


	bool IsColliding(D3DXVECTOR3, D3DXVECTOR3, float);

	bool isVisible()
	{
		return true;
	}

	bool isValid()
	{
		return isTargetable() && !isDead();
	}

	bool isTargetable()
	{
		bool is_targetable = Management::Manager.Read<bool>(basePosition + 0xD3C);

		return is_targetable;
	}

	bool isDead()
	{
		bool is_dead = deobfuscate<bool>(basePosition, 0x3E0);

		return is_dead;
	}

	float GetAttackDelay()
	{
		float val = AttackDelay(basePosition, attack_speed_mod);

		return val;
	}

	float GetAttackCastDelay()
	{
		float val = AttackCastDelay(basePosition, 64);

		return val;
	}

	bool IsAttacking()
	{
		return Management::Manager.Read<int>( basePosition + offsetOf(&CObject::current_attack) ) != 0;
	}

	std::string GetName()
	{
		return std::string(name);
	}
	std::string GetHeroName()
	{
